ConfigFiles/InformationRegisters/СтатусыВстраиванияМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>СтатусыВстраиванияМеханизмов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусВстраивания</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыВстраиванияФункцийМеханизмов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Механизм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыПроекта</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектМетаданных</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыМетаданных</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ФункцияМеханизма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФункцииМеханизмов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ConfigFiles/Enums/СтатусыВстраиванияФункцийМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыВстраиванияФункцийМеханизмов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Встроена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеВстраивается</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеобходимоВстроить</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТребуетсяАнализ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Встраивается</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Catalogs/ФункцииМеханизмов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФункцииМеханизмов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.РазделыПроекта</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИнструкцияПоВстраиванию</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПрограммныйИнтерфейс</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВстраиваетсяВДокументы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВстраиваетсяВСправочники</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

ConfigFiles/InformationRegisters/СтатусыВстраиванияМеханизмов/Ext/RecordSetModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Механизм = ЭтотОбъект.Отбор.Механизм.Значение;
	ОбъектМетаданных = ЭтотОбъект.Отбор.ОбъектМетаданных.Значение;
	ПустаяФункция = Справочники.ФункцииМеханизмов.ПустаяСсылка();
	
	НовыеСтатусы = ЭтотОбъект.Выгрузить();
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	НовыеСтатусы.Механизм КАК Механизм,
	|	НовыеСтатусы.ОбъектМетаданных КАК ОбъектМетаданных,
	|	НовыеСтатусы.СтатусВстраивания КАК СтатусВстраивания,
	|	НовыеСтатусы.ФункцияМеханизма
	|ПОМЕСТИТЬ НовыеСтатусы
	|ИЗ
	|	&НовыеСтатусы КАК НовыеСтатусы
	|ГДЕ
	|	НовыеСтатусы.ФункцияМеханизма <> ЗНАЧЕНИЕ(Справочник.ФункцииМеханизмов.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	НовыеСтатусы.Механизм КАК Механизм,
	|	НовыеСтатусы.ОбъектМетаданных КАК ОбъектМетаданных,
	|	НовыеСтатусы.СтатусВстраивания КАК СтатусВстраивания,
	|	НовыеСтатусы.ФункцияМеханизма
	|ИЗ
	|	НовыеСтатусы КАК НовыеСтатусы
	|ГДЕ
	|	НовыеСтатусы.Механизм = &Механизм
	|	И НовыеСтатусы.ОбъектМетаданных = &ОбъектМетаданных
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ФункцииМеханизмов.Владелец КАК Механизм,
	|	&ОбъектМетаданных КАК ОбъектМетаданных,
	|	ВЫБОР
	|		КОГДА СтатусыМеханизмов.СтатусВстраивания = ЗНАЧЕНИЕ(Перечисление.СтатусыВстраиванияФункцийМеханизмов.НеВстраивается)
	|			ТОГДА СтатусыМеханизмов.СтатусВстраивания
	|		ИНАЧЕ
	|			ЕСТЬNULL(СтатусыФункций.СтатусВстраивания, 
	|				ЕСТЬNULL(СтатусыМеханизмов.СтатусВстраивания, ЗНАЧЕНИЕ(Перечисление.СтатусыВстраиванияФункцийМеханизмов.ТребуетсяАнализ))
	|			)
	|	КОНЕЦ КАК СтатусВстраивания,
	|	ФункцииМеханизмов.Ссылка КАК ФункцияМеханизма
	|ИЗ
	|	Справочник.ФункцииМеханизмов КАК ФункцииМеханизмов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыВстраиванияМеханизмов КАК СтатусыФункций
	|		ПО ФункцииМеханизмов.Владелец = СтатусыФункций.Механизм
	|			И ФункцииМеханизмов.Ссылка = СтатусыФункций.ФункцияМеханизма
	|			И СтатусыФункций.ОбъектМетаданных = &ОбъектМетаданных
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыВстраиванияМеханизмов КАК СтатусыМеханизмов
	|		ПО ФункцииМеханизмов.Владелец = СтатусыМеханизмов.Механизм
	|			И СтатусыМеханизмов.ФункцияМеханизма = ЗНАЧЕНИЕ(Справочник.ФункцииМеханизмов.ПустаяСсылка)
	|			И СтатусыМеханизмов.ОбъектМетаданных = &ОбъектМетаданных
	|ГДЕ
	|	НЕ ФункцииМеханизмов.ПометкаУдаления
	|	И НЕ ФункцииМеханизмов.ЭтоГруппа
	|	И (ФункцииМеханизмов.ВстраиваетсяВДокументы ИЛИ ФункцииМеханизмов.ВстраиваетсяВСправочники)
	|	И ФункцииМеханизмов.Владелец = &Механизм
	|	И НЕ ФункцииМеханизмов.Ссылка В (&ФункцииНабора)
	|";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("НовыеСтатусы", НовыеСтатусы);
	Запрос.УстановитьПараметр("ФункцииНабора", НовыеСтатусы.ВыгрузитьКолонку("ФункцияМеханизма"));
	Запрос.УстановитьПараметр("Механизм", Механизм);
	Запрос.УстановитьПараметр("ОбъектМетаданных", ОбъектМетаданных);
	
	// Определим статус механизма
	СтатусыВсехФункций = Запрос.Выполнить().Выгрузить();
	НовыйСтатус = Перечисления.СтатусыВстраиванияФункцийМеханизмов.НеВстраивается;
	Для Каждого Запись Из СтатусыВсехФункций Цикл
		Если Запись.СтатусВстраивания = Перечисления.СтатусыВстраиванияФункцийМеханизмов.Встроена
			ИЛИ Запись.СтатусВстраивания = Перечисления.СтатусыВстраиванияФункцийМеханизмов.НеобходимоВстроить Тогда
			НовыйСтатус = Перечисления.СтатусыВстраиванияФункцийМеханизмов.Встраивается;
		ИначеЕсли Запись.СтатусВстраивания = Перечисления.СтатусыВстраиванияФункцийМеханизмов.ТребуетсяАнализ Тогда
			НовыйСтатус = Перечисления.СтатусыВстраиванияФункцийМеханизмов.ТребуетсяАнализ;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	// Запишем статус механизма
	Набор = РегистрыСведений.СтатусыВстраиванияМеханизмов.СоздатьНаборЗаписей();
	Набор.Отбор.Механизм.Установить(Механизм);
	Набор.Отбор.ОбъектМетаданных.Установить(ОбъектМетаданных);
	Набор.Отбор.ФункцияМеханизма.Установить(ПустаяФункция);
	
	Запись = Набор.Добавить();
	Запись.Механизм = Механизм;
	Запись.ОбъектМетаданных = ОбъектМетаданных;
	Запись.СтатусВстраивания = НовыйСтатус;
	
	Набор.ОбменДанными.Загрузка = Истина;
	Набор.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
